workstation/openfoam-master-tutorials/tutorials/lagrangian/reactingParcelFoam/filter/constant/reactions
species
(
    N2
    O2
    H2O
);

reactions
{}
